## Plan for org_account/roles
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 6 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                  NAME                                   |
|----------|-------------------------------------------------------------------------|
| recreate | `aws_iam_policy.org_account_list_in_sandbox`                            |
|          | `aws_iam_role_policy_attachment.attach_list_accounts_in_sandbox`        |
| add      | `aws_iam_policy.org_account_list`                                       |
|          | `aws_iam_role_policy_attachment.attach_list_accounts`                   |
|          | `module.OIDC_Roles.aws_iam_role.this[&quot;listAccountsInSandboxOUForNuke&quot;]` |
|          | `module.assume_plan_role.aws_iam_role.this`                             |
| delete   | `module.OIDC_Roles.aws_iam_role.this[&quot;listAccountsInOrg&quot;]`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.org_account_list will be created
  + resource "aws_iam_policy" "org_account_list" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ListAccountsInOrg"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "organizations:ListAccounts"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ListAccountsInOrg"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.org_account_list_in_sandbox must be replaced
-/+ resource "aws_iam_policy" "org_account_list_in_sandbox" {
      ~ arn       = "arn:aws:iam::659087519042:policy/listAccountsInOrg" -> (known after apply)
      ~ id        = "arn:aws:iam::659087519042:policy/listAccountsInOrg" -> (known after apply)
      ~ name      = "listAccountsInOrg" -> "listAccountsInSandboxOUForNuke" # forces replacement
      ~ policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action   = "organizations:ListAccountsForParent"
                        Effect   = "Allow"
                        Resource = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-qhvjdryl"
                        Sid      = "ListAccountsInSandboxOU"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ policy_id = "ANPAZS5FNNVBCCXWSOECF" -> (known after apply)
      - tags      = {} -> null
      ~ tags_all  = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.attach_list_accounts will be created
  + resource "aws_iam_role_policy_attachment" "attach_list_accounts" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "listAccountsInSandboxOUForNuke"
    }

  # aws_iam_role_policy_attachment.attach_list_accounts_in_sandbox must be replaced
-/+ resource "aws_iam_role_policy_attachment" "attach_list_accounts_in_sandbox" {
      ~ id         = "listAccountsInOrg-20230106170137705100000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::659087519042:policy/listAccountsInOrg" -> (known after apply) # forces replacement
      ~ role       = "listAccountsInOrg" -> "listAccountsInSandboxOUForNuke" # forces replacement
    }

  # module.OIDC_Roles.aws_iam_role.this["listAccountsInOrg"] will be destroyed
  # (because key ["listAccountsInOrg"] is not in for_each map)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::659087519042:role/listAccountsInOrg" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - token.actions.githubusercontent.com:sub = [
                                  - "repo:cds-snc/site-reliability-engineering:ref:refs/heads/main",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::659087519042:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-01-06T17:01:37Z" -> null
      - force_detach_policies = false -> null
      - id                    = "listAccountsInOrg" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::659087519042:policy/listAccountsInOrg",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "listAccountsInOrg" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "cds-aws-lz-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "cds-aws-lz-production"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROAZS5FNNVBBIZUI4ON5" -> null
    }

  # module.OIDC_Roles.aws_iam_role.this["listAccountsInSandboxOUForNuke"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + token.actions.githubusercontent.com:sub = [
                                  + "repo:cds-snc/site-reliability-engineering:ref:refs/heads/main",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::659087519042:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "listAccountsInSandboxOUForNuke"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.assume_plan_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::794722365809:role/cartographyOrgListIds"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "assumeCartographyOrg"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.org_account_list"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.org_account_list_in_sandbox"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
